Revit 2026 API

# MEPCurveTypeMultiShapeTransition Property

---

The default multi shape transition fitting of the MEP curve type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilySymbol MultiShapeTransition { get; set; }
```
```vb
Public Property MultiShapeTransition As FamilySymbol
	Get
	Set
```
```cpp
public:
property FamilySymbol^ MultiShapeTransition {
	FamilySymbol^ get ();
	void set (FamilySymbol^ value);
}
```
```fsharp
member MultiShapeTransition : FamilySymbol with get, set
```

#### Property Value

FamilySymbol

This property is used to retrieve the default multi shape transition fitting of the MEP curve type, and can be  if there is no default value. Use RoutingPreferenceManager to set this property for PipeType MEPCurves.

#### Reference

MEPCurveType Class

Autodesk.Revit.DB Namespace